package test;

public class Test {

    //后端
    //模型 字段 模型执行 执行数据分表
    //变量排序, 变量依赖提取, 内置函数
    //跨模型字段引用
    //模型输入
    //模型输出
    //迭代执行, 创建多人工资表详情
    //初始值设定  payableTotal = payableTotal + payable , 初始值什么时候设定?

    //后端 第二阶段
    //TODO 动态建模, 执行动态建模, 模型参数化
    //TODO 只写接口用例 不做UI
    //TODO 模型设置
    //TODO data-tracer

    //TODO 两条腿走路, 后端已具初步形态, 前端该搭建架子, 避免后期后端调整过大

    //前端
    //TODO 脚手架选择-用户体系, 权限体系(权限控制, 数据范围)
    //TODO 模型数据展示(表格), 操作, 编辑, 查看 - 此能力需结合后端模型设置
    //TODO 公式编辑器数据结构, 展示结构
    //TODO 表单 结合前端UI
    //TODO 工作流

    //TODO 设计宗旨 - 规范(标准),简单(易用),扩展(灵活,可配置,可介入硬编码)
    //TODO 项目目标 - 小微企业使用Saas完成HR|OA|CRM|CMS|TMS
    //TODO 私有化 - 代码安全-native 或 模型运行态(无模型编辑和新建能力)

   //TODO 以上计划写于2025-08-08日晚23:50


}
